/**
 * Crew Neck shirt
 */
const ShirtCrewNeck = ({ color }: { color: string }) => {
  return (
    <svg
      id="Clothing_Shirt_Crew_Neck"
      data-name="Clothing/Shirt Crew Neck"
      xmlns="http://www.w3.org/2000/svg"
      xmlnsXlink="http://www.w3.org/1999/xlink"
      width="264"
      height="110"
      viewBox="0 0 264 110"
    >
      <defs>
        <clipPath id="shirtpath">
          <path
            id="Clothes"
            d="M32,110v-8.948A71.729,71.729,0,0,1,51.477,51.8,72.214,72.214,0,0,1,72.769,36.159,71.374,71.374,0,0,1,99.045,29.22c-.03.369-.045.748-.045,1.127a15.027,15.027,0,0,0,2.632,8.362,23.883,23.883,0,0,0,7.179,6.827,38.193,38.193,0,0,0,10.649,4.6,51.224,51.224,0,0,0,26.079,0,38.2,38.2,0,0,0,10.648-4.6,23.883,23.883,0,0,0,7.179-6.827A15.028,15.028,0,0,0,166,30.347c0-.349-.014-.7-.04-1.052A72.008,72.008,0,0,1,232,101.052V110H32Z"
            fill="none"
          />
        </clipPath>
      </defs>
      <g id="Group_7" data-name="Group 7">
        <g id="Clothes-2" data-name="Clothes">
          <path
            id="Clothes-3"
            data-name="Clothes"
            d="M200,80.78H0V71.833A71.732,71.732,0,0,1,19.477,22.583,72.214,72.214,0,0,1,40.768,6.94,71.371,71.371,0,0,1,67.045,0C67.015.37,67,.749,67,1.128a15.024,15.024,0,0,0,2.633,8.361,23.9,23.9,0,0,0,7.179,6.828,38.207,38.207,0,0,0,10.649,4.6,49.84,49.84,0,0,0,13.04,1.688,49.837,49.837,0,0,0,13.04-1.688,38.206,38.206,0,0,0,10.648-4.6,23.9,23.9,0,0,0,7.179-6.828A15.024,15.024,0,0,0,134,1.128c0-.349-.013-.7-.04-1.052A72.006,72.006,0,0,1,200,71.833v8.947Z"
            transform="translate(32 29.22)"
            fill="#e6e6e6"
          />
          <path
            id="Clothes-4"
            data-name="Clothes"
            d="M200,80.78H0V71.833A71.732,71.732,0,0,1,19.477,22.583,72.214,72.214,0,0,1,40.768,6.94,71.371,71.371,0,0,1,67.045,0C67.015.37,67,.749,67,1.128a15.024,15.024,0,0,0,2.633,8.361,23.9,23.9,0,0,0,7.179,6.828,38.207,38.207,0,0,0,10.649,4.6,49.84,49.84,0,0,0,13.04,1.688,49.837,49.837,0,0,0,13.04-1.688,38.206,38.206,0,0,0,10.648-4.6,23.9,23.9,0,0,0,7.179-6.828A15.024,15.024,0,0,0,134,1.128c0-.349-.013-.7-.04-1.052A72.006,72.006,0,0,1,200,71.833v8.947Z"
            transform="translate(32 29.22)"
            fill="none"
          />
        </g>
        <g
          id="Mask_Group_7"
          data-name="Mask Group 7"
          clipPath="url(#shirtpath)"
        >
          <g id="_Color_Fabric" data-name="↳ Color Fabric">
            <g id="_Color" data-name="🖍Color">
              <rect
                id="_Color-2"
                data-name="🖍Color"
                width="264"
                height="110"
                fill={color}
              />
              <rect
                id="_Color-3"
                data-name="🖍Color"
                width="264"
                height="110"
                fill="none"
              />
            </g>
          </g>
          <g id="Shadowy" transform="translate(92 4)" opacity="0.6">
            <ellipse
              id="Hola_"
              data-name="Hola 👋🏼"
              cx="39.635"
              cy="26.914"
              rx="39.635"
              ry="26.914"
              transform="translate(0.865 0.934)"
              fill="rgba(0,0,0,0.16)"
            />
          </g>
        </g>
      </g>
    </svg>
  );
};

export default ShirtCrewNeck;
